const CharTimeout = 20; // скорость печатания
const StoryTimeout = 3000000; // время ожидания перед переключением

const Summaries = new Array();
const SiteLinks = new Array();

  Summaries[0] = ` Строительство Синагоги было начато летом 1907 года и завершено в рекордные сроки - через 4 месяца. Деньги на строительство каменной синагоги были собраны от продажи с торгов мест в будущей синагоге. Самые дорогие места в первом ряду были проданы от 900 до 1200 рублей, удалённые места стоили дешевле. Так было собрано до 90 тысяч рублей, составивших основной капитал постройки. Раввином (учённым) стал купец Лев Исаевич Шергов. Синагога считалась вторым по величине культовым сооружением города после собора Великого князя Александра Невского. При синагоге действовали: школьный комитет, общество помощи бедным евреям, молодёжные организации "Кодима" и "Гешахар", спортивная секция "Маккаби", редакция журнала "вестник сибирских евреев".
До 1917 года еврейская община была самой организованной и самой богатой в городе. После в 1920 году Синагога была национализирована, но службы в ней продолжались до 1929 года. В 1929 году через газеты начались дискуссии, нужна или нет синагога верующим. Пошли разговоры, что посещается она слабо, что "десять чудаковатых стариков занимают такое большое здание", предлагалось отдать помещение синагоги под клуб или Дом Красной Армии. Затем у синагоги установили громкоговоритель, через который вели антирелигиозную пропаганду. В результате к началу 1930 года службы в Синагоге были прекращены, а здание сначала передали под общежитие беженцев из Китая, прибывших в Читу после конфликта на КВЖД, а затем под учебные заведения (лесотехникум, педрабфак и лесорабфак). В 1938 году в здании бывшей синагоги разместились сельхозбанк, областное управление народнохозяйственного учёта, облздравотдел, облсобес и контора "Главсахар". В период Великой отечественной войны их выселил эвакогоспиталь, о чём свидетельствует памятная табличка на фасаде здания. А после в здание въехало областное управление сельского хозяйства, которое оставалось основным арендатором на протяжении многих лет. В 2004 синагога приютила погорельцев - чиновников комитета по управлению имуществом города, размещались в синагоге и управление федеральной службы по ветеринарному и фитосанитарному надзору Забайкальского края. Начиная с 2011 года здесь находится УИИ (Уголовно исполнительная инспекция). Мы очень сильно ждем того момента когда наш дом перейдет к еврейской общине, дабы восстановить историческую и культурную ценность нашей Синагоги `;
  // SiteLinks[0] = '';
  // Summaries[1] = '';
  // SiteLinks[1] = '';
  // Summaries[2] = '';
  // SiteLinks[2] = '';
  // Summaries[3] = '';
  // SiteLinks[3] = '';
  // Summaries[4] = '';
  // SiteLinks[4] = '';
  // Summaries[5] = '';
  // SiteLinks[5] = '';
  // Summaries[6] = '';
  // SiteLinks[6] = '';

/* Печатание текста - Тиккер
----------------------------------------------------------------
var CharTimeout = 20;
var StoryTimeout = 7000;
var Summaries = new Array();
var SiteLinks = new Array();
  Summaries[0] = "CMS для простых сайтов GetSimple на русском языке";
  SiteLinks[0] = "#link1";
  Summaries[1] = "Spectrum - шикарная тема для WordPress на русском языке";
  SiteLinks[1] = "#link2";
startTicker();
*/

function startTicker(){
  massiveItemCount =  Number(Summaries.length); //количество элементов массива
  // Определяем значения запуска
  CurrentStory     = -1;
  CurrentLength    = 0;
  // Расположение объекта
  AnchorObject     = document.getElementById("Ticker");
  runTheTicker();
}
// Основной цикл тиккера
function runTheTicker(){
  let myTimeout;
  // Переход к следующему элементу
  if(CurrentLength == 0){
    CurrentStory++;
    CurrentStory      = CurrentStory % massiveItemCount;
    StorySummary      = Summaries[CurrentStory].replace(/"/g,'-');
    AnchorObject.href = SiteLinks[CurrentStory];
  }
  // Располагаем текущий текст в анкор с печатанием
  AnchorObject.innerHTML = StorySummary.substring(0,CurrentLength) + znak();
  // Преобразуем длину для подстроки и определяем таймер
  if(CurrentLength != StorySummary.length){
    CurrentLength++;
    myTimeout = CharTimeout;
  } else {
    CurrentLength = 0;
    myTimeout = StoryTimeout;
  }
  // Повторяем цикл с учетом задержки
  setTimeout("runTheTicker()", myTimeout);
}
// Генератор подстановки знака
function znak(){
  if(CurrentLength == StorySummary.length) return "";
  else return "|";
}

startTicker();